#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Success! The configuration is valid.

azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev]
azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/serverFarms/asp-cpeq-dev-eastus]
azurerm_linux_function_app_slot.dev: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/sites/func-cpeq-dev-eastus/slots/dev]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Storage/storageAccounts/st0cpeq0dev]
azurerm_linux_function_app.function_app: Refreshing state... [id=/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/sites/func-cpeq-dev-eastus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.app will be created
  + resource "azurerm_container_app" "app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-cpeq-dev-canadaeast"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "CPEQ-dev"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 80
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = (known after apply)
          + server   = (known after apply)
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "cpeq/infolettre-automatique:latest"
              + memory            = "0.5Gi"
              + name              = "infolettre-automatique"
            }
        }
    }

  # azurerm_container_app_environment.environment will be created
  + resource "azurerm_container_app_environment" "environment" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "canadaeast"
      + mutual_tls_enabled               = false
      + name                             = "cae-cpeq-dev-canadaeast"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "CPEQ-dev"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }
      + zone_redundancy_enabled          = false
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "canadaeast"
      + login_server                  = (known after apply)
      + name                          = "crcpeqdevcanadaeast"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "CPEQ-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_linux_function_app.function_app will be destroyed
  # (because azurerm_linux_function_app.function_app is not in configuration)
  - resource "azurerm_linux_function_app" "function_app" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"        = "0"
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "func-cpeq-dev-eastus.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = true -> null
      - id                                             = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/sites/func-cpeq-dev-eastus" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "eastus" -> null
      - name                                           = "func-cpeq-dev-eastus" -> null
      - outbound_ip_address_list                       = [
          - "13.82.169.160",
          - "52.168.4.130",
          - "13.82.171.2",
          - "13.82.169.153",
          - "13.92.237.218",
        ] -> null
      - outbound_ip_addresses                          = "13.82.169.160,52.168.4.130,13.82.171.2,13.82.169.153,13.92.237.218" -> null
      - possible_outbound_ip_address_list              = [
          - "13.82.169.160",
          - "52.168.4.130",
          - "13.82.171.2",
          - "13.82.169.153",
          - "52.224.48.224",
          - "52.234.133.108",
          - "20.72.169.205",
          - "20.72.171.105",
          - "20.72.171.155",
          - "20.72.171.159",
          - "20.72.171.176",
          - "20.72.171.194",
          - "20.242.242.54",
          - "20.242.242.94",
          - "20.83.129.68",
          - "20.83.129.222",
          - "20.83.129.248",
          - "20.83.129.250",
          - "13.92.237.218",
        ] -> null
      - possible_outbound_ip_addresses                 = "13.82.169.160,52.168.4.130,13.82.171.2,13.82.169.153,52.224.48.224,52.234.133.108,20.72.169.205,20.72.171.105,20.72.171.155,20.72.171.159,20.72.171.176,20.72.171.194,20.242.242.54,20.242.242.94,20.83.129.68,20.83.129.222,20.83.129.248,20.83.129.250,13.92.237.218" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "CPEQ-dev" -> null
      - service_plan_id                                = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/serverFarms/asp-cpeq-dev-eastus" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "st0cpeq0dev" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "environment" = "dev"
          - "project"     = "CPEQ"
        } -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (5 unchanged attributes hidden)

      - site_config {
          - always_on                                     = false -> null
          - app_scale_limit                               = 200 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - application_insights_key                      = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }

      - sticky_settings {
          - app_setting_names       = [
              - "APPINSIGHTS_INSTRUMENTATIONKEY",
              - "APPLICATIONINSIGHTS_CONNECTION_STRING ",
              - "APPINSIGHTS_PROFILERFEATURE_VERSION",
              - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              - "ApplicationInsightsAgent_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_BaseExtensions",
              - "DiagnosticServices_EXTENSION_VERSION",
              - "InstrumentationEngine_EXTENSION_VERSION",
              - "SnapshotDebugger_EXTENSION_VERSION",
              - "XDT_MicrosoftApplicationInsights_Mode",
              - "XDT_MicrosoftApplicationInsights_PreemptSdk",
              - "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              - "XDT_MicrosoftApplicationInsightsJava",
              - "XDT_MicrosoftApplicationInsights_NodeJS",
            ] -> null
          - connection_string_names = [] -> null
        }
    }

  # azurerm_linux_function_app_slot.dev will be destroyed
  # (because azurerm_linux_function_app_slot.dev is not in configuration)
  - resource "azurerm_linux_function_app_slot" "dev" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"        = "0"
          - "WEBSITE_MOUNT_ENABLED"    = "1"
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "func-cpeq-dev-eastus-dev.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - function_app_id                                = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/sites/func-cpeq-dev-eastus" -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = true -> null
      - id                                             = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/sites/func-cpeq-dev-eastus/slots/dev" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - name                                           = "dev" -> null
      - outbound_ip_address_list                       = [] -> null
      - possible_outbound_ip_address_list              = [] -> null
      - public_network_access_enabled                  = true -> null
      - site_credential                                = (sensitive value) -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {} -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (9 unchanged attributes hidden)

      - site_config {
          - always_on                                     = false -> null
          - app_scale_limit                               = 200 -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "Python|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (9 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id         = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev" -> (known after apply)
      ~ location   = "eastus" -> "canadaeast" # forces replacement
        name       = "CPEQ-dev"
        tags       = {
            "environment" = "dev"
            "project"     = "CPEQ"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.app_acrpull will be created
  + resource "azurerm_role_assignment" "app_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.service_plan will be destroyed
  # (because azurerm_service_plan.service_plan is not in configuration)
  - resource "azurerm_service_plan" "service_plan" {
      - id                           = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Web/serverFarms/asp-cpeq-dev-eastus" -> null
      - kind                         = "functionapp" -> null
      - location                     = "eastus" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "asp-cpeq-dev-eastus" -> null
      - os_type                      = "Linux" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "CPEQ-dev" -> null
      - sku_name                     = "Y1" -> null
      - tags                         = {
          - "environment" = "dev"
          - "project"     = "CPEQ"
        } -> null
      - worker_count                 = 0 -> null
      - zone_balancing_enabled       = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.storage will be destroyed
  # (because azurerm_storage_account.storage is not in configuration)
  - resource "azurerm_storage_account" "storage" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "LRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/04378d5e-acd4-4f37-9048-ab746c3e385d/resourceGroups/CPEQ-dev/providers/Microsoft.Storage/storageAccounts/st0cpeq0dev" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - local_user_enabled                = true -> null
      - location                          = "eastus" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "st0cpeq0dev" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://st0cpeq0dev.blob.core.windows.net/" -> null
      - primary_blob_host                 = "st0cpeq0dev.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://st0cpeq0dev.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "st0cpeq0dev.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://st0cpeq0dev.file.core.windows.net/" -> null
      - primary_file_host                 = "st0cpeq0dev.file.core.windows.net" -> null
      - primary_location                  = "eastus" -> null
      - primary_queue_endpoint            = "https://st0cpeq0dev.queue.core.windows.net/" -> null
      - primary_queue_host                = "st0cpeq0dev.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://st0cpeq0dev.table.core.windows.net/" -> null
      - primary_table_host                = "st0cpeq0dev.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://st0cpeq0dev.z13.web.core.windows.net/" -> null
      - primary_web_host                  = "st0cpeq0dev.z13.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "CPEQ-dev" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "environment" = "dev"
          - "project"     = "CPEQ"
        } -> null
        # (24 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_user_assigned_identity.identity will be created
  + resource "azurerm_user_assigned_identity" "identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "canadaeast"
      + name                = "id-func-dev-canadaeast"
      + principal_id        = (known after apply)
      + resource_group_name = "CPEQ-dev"
      + tags                = {
          + "environment" = "dev"
          + "project"     = "CPEQ"
        }
      + tenant_id           = (known after apply)
    }

Plan: 6 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```

</details>

*Pusher: @emileturcotte, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform: Validate, Plan, Deploy`*